---
kind: method
id: M:Autodesk.Revit.DB.PointClouds.IPointSetIterator.Free
source: html/2ea93038-7c58-eec5-5f1a-801e918cb8ac.htm
---
# Autodesk.Revit.DB.PointClouds.IPointSetIterator.Free Method

Use this method to discard any resources consumed by the iterator. Revit will call it when done using the iterator.

## Syntax (C#)
```csharp
void Free()
```